import React from 'react'
import { translate } from 'react-i18next'

const AboutView = () => (
    <div className="row">
        <div className="col-lg-12">

            <div className="row">
                <div className="col-lg-12">
                    <h1 className="my-4">Кто я?</h1>
                </div>
                <div className="col-lg-12">
                    <p>Меня зовут Александра. Когда-то в далеком 2005 году я приняла судьбоносное для себя решение. После окончания школы в городе Красноярске я решила поступить не в один из местных ВУЗов как все мои одноклассники, а выбрала Тартуский университет в Эстонии. «Зачем уезжать так далеко, почему я выбрала именно Эстонию?» — спросите Вы. Конечно, это не было спонтанным решением, как может показаться сначала, ведь между Красноярском и Эстонией более 4000 км. У меня по маминой линии эстонские корни и по рекомендации эстонского общества в нашем городе я подала заявку на стипендию от Министерства образования Эстонской Республики. Программа «Соплеменник» работает с 2004 года. Согласно информации, размещённой на официальном интернет-сайте эстонского Министерства образования и науки, целью выдачи такой стипендии  является поддержка живущей заграницей эстонской молодежи в получении образования в государственных университетах, прикладных высших учебных заведениях и центрах профессионального обучения Эстонии.</p>
                </div>
                <div className="col-lg-12">
                    <p>Но есть один очень важный нюанс,  на стипендию могут рассчитывать только те кандидаты, которые хотят учиться на эстонском языке. Что это значит? Уже владеешь эстонским языком — отлично. Вперед на выбранный факультет. Если нет, то, как говорится,  научат. В моём случае был очевиден второй вариант, и перед зачислением на социальный факультет мне предоставили в университете города Тарту годовой интенсивный курс эстонского языка. Позже было получение степени бакалавра и затем магистра в этом университете, при этом курсов языка за 6 лет проживания в Эстонии  было не мало. Тарту, где, в основном, проживают носители языка, очень помог мне осваивать незнакомый для меня eesti keel.  Полученные мною знания сразу проверялись на практике, ведь я жила среди эстонцев и даже успела поработать в свободное от учебы время. Но тогда я пришла к интересному выводу, чтобы до конца самостоятельно уяснить все причуды сложного, но безумно красивого эстонского языка мне нужно объяснить всю эту теорию кому-то. Рассказывая о правилах и строении эстонского языка, в моей голове все наконец-то раскладывалось, что называется, «по полочкам». Именно так и родилась идея — преподавать!
                        Да, я не профессиональный педагог и не специалист в области филологии эстонского языка, но я настоящий фанат своего дела! В итоге я окончила Тартуский университет по специальности «Международные отношения». Преподавать — это всего лишь мое хобби. В своей основной работе я продолжаю общаться с эстонцами и улучшать свои разговорные навыки, что помогает мне оставаться в тонусе. Мне безумно нравится видеть как мои ученики делают свои первые шаги в языке, как они преодолевают свой языковой барьер, начинают общаться и понимать друг друга, используя полученные на наших совместных уроках навыки коммуникации.</p>
                </div>
                <div className="col-lg-12">
                    <h3 className="my-4">Кому будет полезен сайт keeltkoigile.com?</h3>
                </div>
                <div className="col-lg-12">
                    <p>Как я уже говорила, преподавание — это мое хобби. Я получаю огромное удовольствие от общения с учениками, единомышленниками. В какой-то момент я осознала, что мне хочется сделать для Эстонии что-то очень полезное и отблагодарить Вселенную за тот уникальный шанс, который предоставило мне эстонское государство — быть студентом такого замечательного alma-mater! Да, конечно, правительство Эстонии не услышит мое СПАСИБО, но все же я постараюсь внести свою маленькую лепту в распространении эстонского языка на нашей планете. Да, Вы не ослышались, я решила поступить по  принципу: выучил сам — поделись с другими. Преподавать эстонский язык было решено в 2010 году, тогда моими помощниками стали известные всем учебники (про ассортимент книжных магазинов отдельно пообщаемся в блоге). За основу уроков мы с учениками взяли учебники в зависимости от уровня владения. Для объяснения грамматических особенностей мне, а потом и моим ученикам  приходилось использовать  достаточно много и  различных по способу подачи материала источников. Одна тема хорошо объяснена в одном сборнике, другая в справочнике по грамматике, для третьей нужны некие таблицы, а то и ещё приходилось труднее: рассматривали несколько книг одновременно и сравнивали подачу материала, выбирали какой из них для нас окажется доступнее и проще. Именно тогда мне пришла в голову идея написать свою книгу по грамматике эстонского языка. Рассказать в ней о том как и в какой последовательности я вижу изучение языка. Логике изложения материала я уделяю особое внимание. Ведь чем логичней мне удаётся выдать материал, без использования любимых эстонскими преподавателями фраз «так хорошо звучит, это просто нужно запомнить», тем быстрее мы переходили от теории к практике. </p>
                </div>
                <div className="col-lg-12">
                    <p>На этом сайте я разместила собственные, накопленные за долгие годы, материалы по грамматике эстонского языка, а также упражнения к ним. </p>
                </div>
                <div className="col-lg-12">
                    <p>Не спорю о том, что количество преподавателей равно количеству стилей преподавания. Моя методика родилась на базе обучения у тех преподавателей, которые работали  на курсах в Тартуском университете, неоднократно корректировалась, проверялась на моих учениках с разным уровнем владения эстонским языком.  Мы вместе добиваемся результатов и идем к поставленной цели. Многие из моих учеников уже успешно сдали уровневые экзамены на знание эстонского языка, некоторые из них только собираются это сделать, но есть и такие, для которых эстонский язык нужен на минимальном уровне — знать дежурные фразы и необходимую лексику для поездок в Эстони, так сказать туристический вариант. Цели у изучающих язык разные, но все-таки мы вместе — всех нас объединяет интерес к этому прекрасному языку»!</p>
                </div>
                <div className="col-lg-12">
                    <p>На этом сайте  я постараюсь просто и лаконично преподнести  все сложности эстонского языка. </p>
                </div>
                <div className="col-lg-12">
                    <p>Если у Вас есть комментарии или пожелания, то Вы всегда можете это сделать по электронной почте <a href="mailto:keeltkoigile@gmail.com">keeltkoigile@gmail.com</a>.</p>
                </div>
                <div className="col-lg-12">
                    <p>Удачи в изучении эстонского языка!<br/>Edu teile eesti keele õppimisel!</p>
                </div>
                <div className="col-lg-12">
                    <h3 className="my-4">Как работать с сайтом?</h3>
                </div>
                <div className="col-lg-12">
                    <p>Сайт построен по типу самоучителя. Материалы пронумерованы в форме уроков и соответствующих им заданий. В начале урока задана основная тема. Поэтому, если Вы только начинаете свой путь в изучении эстонского языка, то советую начинайть с первого урока. Ранее уже изучали? Тогда тренируйте проблемные для себя темы. Повторение — мать учения. ☺</p>
                </div>
                <div className="col-lg-12">
                    <p>В разделе «Тексты» собраны тексты на различные темы и  наработки по развитию словарного запаса. Начинайте с самого первого — в порядке увеличения сложности. </p>
                </div>
                <div className="col-lg-12">
                    <p>В блоге я буду делиться с Вами своими мыслями об обучении и изучении эстонского языка, ведь я когда-то сама начинала с нуля, и прошла этот путь, чтобы сейчас с гордостью сказать: «Да, я владею эстонским языком!» Может быть я не владею всеми его премудростями , но я чувствую себя свободно при общении с эстонцами. Я понимаю, и меня понимают. Это очень классное чувство!</p>
                </div>
                <div className="col-lg-12">
                    <p>ДЕРЗАЙТЕ! И ВСЕ ОБЯЗАТЕЛЬНО ПОЛУЧИТСЯ!<br/>KIVI KOTTI!</p>
                </div>
            </div>
        </div>
    </div>
)

export default translate()(AboutView)
