import React from 'react'
import { translate } from 'react-i18next'
import MarkdownPage from '../components/MarkdownPage'

const source = `
На прошлом уроке мы и правда вплотную занялись глаголами. Верю, что вам встретилось много новых слов. И мы помним, что учить глаголы нужно в трех основных формах: 2 формы инфинитива и форму настоящего времени. Ваши списки выписанных глаголов должны пополняться каждый день. Но о вот о значениях и использовании некоторых глаголов я все-таки хотела бы поговорить подробнее. Ну и конечно же не все еще грамматических формы вы разобрали, так что приступим и обо всем попорядку.
Глаголы движения – minema, käima, sõitma, tulema.
Глагол minema на русский язык переводится как идти, выражает обычно конкретное движение «куда-то» и/или «откуда-то», отдаление, с указанием направления. Ma lähen kooli. Я иду в школу. NB! Можно также  использовать в случае движения при помощи транспортного средства. Ma lähen täna kooli bussiga. Я  еду (направляюсь) в школу на автобусе.
Глагол sõitma. Перевод – ехать. Выражает движение на транспорте как в направлении «куда?», так и «откуда?». Ma sõidan kodust tööle autoga. Из дома на работу я еду на машине.
Käima. Можем перевести как – ходить, бывать. Обязательно требует вопроса – «где?» – «kus?», и ни в коем случае «куда?», так как обычно выражает многократное, повторяющееся движение как пешком, так и транспортом. Ma käin lasteaias. Я хожу в детский сад. Ma käin poes ja ostan piima koju. Я хожу в магазин и покупаю молоко домой.
И напоследок глагол tulema – приходить, возвращаться. Обозначает приближение, возможно использовать  в направлении  как «куда?», так и «откуда?». Millal sa koju tuled? Когда ты вернешься домой? Ma tulen töölt koju kell viis. Я вернусь с работы домой в 5 часов.

### Модальные глаголы

Отдельной группой можно выделить так называемые модальные глаголы. Это такие глаголы, которые выражают не действие, а отношение к нему: возможность, необходимость, способность, вероятность и т. д. совершения действия.  Как Вы могли заметить из таблиц использования инфинитивов, таких глаголов достаточно много. В список наиболее часто используемых глаголов можно внести: saama, tohtima, võima, suutma, jõudma, pidama (быть должным), tulema (приходиться), oskama (знать, уметь), pruukima (стоить, должен), tarvitsema (стоить, должен) и т.д.. Но особо проблематичными будут здесь первые пять глаголов, так как все одинаково переводятся - «мочь». Поговорим о каждом из них по-отдельности и определим различия между ними.
Глагол saama (saada, saab). Он показывает, что что-то возможно сделать, так как для этого созданы все необходимые условия. Ma saan restoranis süüa, kuna mul on raha. Я могу покушать в ресторане, так как у меня есть деньги. Ma ei saa külla tulla, sest mul ei ole kingi. Я не могу прийти в гости, так как у меня нет подарка.
Tohtima (tohtida, tohib). Особенность этого глагола: его значение указывает на то, что что-то возможно сделать, так как есть на это разрешение. При отрицании явный запрет – «нельзя». Siin tohib jopes istuda. Здесь можно сидеть в куртке. Lennukis ei tohi suitsetada. В самолете нельзя курить.
Võima (võida, võib). У данного глагола 3 значения. Во-первых, он может быть синонимом tohtima, то есть выражать разрешение на действие. Lennukis ei või suitsetada. В самолете нельзя курить. Во-вторых, глагол показывает, что действие возможно, и при этом у лица, выполняющего действие, есть желание это делать. Ma võin sind aidata. Я могу тебе помочь. И в-третьих, глагол может показывать вероятность будущих событий, прогноз, что именно так все и может произойти. Homme võib hakata lund sadama. Завтра может пойти снег.
Suutma (suuta, suudab). Этот глагол используется в значении могу, то есть у  нас есть силы и желание это сделать. Ma suudan olla terve päeva söömata. Я могу не есть целый день.
Jõudma (jõuda, jõuab). Основа этого глагола jõud, сила. То есть значение «могу» расценивается как быть в состоянии, в силе что-либо сделать. Ma ei jõua enam kannatada.  Я не могу больше терпеть (у меня нет сил терпеть). Также есть вариант перевода как мочь, в значении успевать. Ma jõuan koju kella kaheksani. Я успею домой, к восьми (смогу добраться).

С модальными глаголами мы познакомились, но «модальность», то есть  оценку отношения действий говорящего к действительности, можно выразить и другими способами. Один из них – это выражение при помощи форм наклонений глагола. Категория наклонения - это такая грамматическая форма глагола, определяющая модальность действия. В русском языке выделяют три наклонения: изъявительное, сослагательное, повелительное. В эстонском языке к ним следует добавить еще косвенное наклонение.
Изъявительное наклонение хоть мы и не выделяли отдельно, но оно нам знакомо. Глаголы в изъявительном наклонении обозначают действия, которые происходят, происходили или будут происходить на самом деле: mina olen armastanud, armastan praegu, või alles hakkan sind armastama – я любил, люблю сейчас или только начинаю любить. Это все известные нам формы прошедшего, настоящего и будущего времени.
С повелительным наклонением мы тоже с Вами уже знакомились. Мы выделяли формы единственного числа и множественного. При переводе мы как бы обращается «к тебе», или «к вам» приказывая, требуя, прося что-либо сделать. Tee palun, tehke – сделай пожалуйста, сделайте. 
Сослагательное наклонение или условное.
Глаголы в сослагательном наклонении обозначают действия, желаемые или возможные при определённых условиях: teeksin - сделал бы, tooksin - принёс бы. Как видно из примеров, на русский язык мы переводим, использую частицу б(ы). Давайте разберем теперь, как нам образовать эти самые формы в эстонском языке.
Признак условного наклонения – это суффиксы -ksi-, -ks, которые добавляются к основе глагола в настоящем времени. Обратите внимания на личные окончания после суффиксов, у третьего лица единственного числа оно совсем отсутствует, а у множественного числа этого же лица вместо привычного -vad, мы видим просто -d. 
Tahtma, tahta, tahab – хотеть:

<table>
    <tr>
        <td>Утвердительная форма
            Jaatav vorm
        </td>
        <td>Отрицательная форма
            Eitav vorm
        </td>
    </tr>
    <tr>
        <td>ma tahaksin armastada</td>
        <td>ma ei tahaks armastada
    <tr>
        <td>sa tahaksid armastada</td>
        <td>sa ei tahaks armastada
    <tr>
        <td>ta tahaks armastada</td>
        <td>ta ei tahaks armastada
    <tr>
        <td>me tahaksime armastada</td>
        <td>me ei tahaks armastada
    <tr>
        <td>te tahaksite armastada</td>
        <td>te ei tahaks armastada
    <tr>
        <td>nad tahaksid armastada</td>
        <td>nad ei tahaks armastada
</table>

В первой колонке таблицы выше можно увидеть так называемые полные утвердительные формы условного наклонения. Все чаще в современном языке можно услышать и короткие формы, где для всех лиц и чисел используется одна и та же форма с суффиксом -ks: ma tahaks armastada, sa tahaks armastada…
Эти формы настоящего времени условного наклонения используются, когда имеется в виду настоящее, будущее или не конкретизированное время, хотя на русский язык и переводим прошедшим временем. 
Ma läheksin nüüd magama, aga ei taha. Я бы пошел сейчас спать, но не хочу.
Для выражения действия, которое могло бы случиться в прошлом, используется форма прошедшего времени условного наклонения. Эта форма образуется при помощи вспомогательного глагола olema в форме настоящего времени сослагательного наклонения и причасти -nud. 
Точно также как в настоящем времени, здесь во всех лицах можно использовать для глагола olema короткую форму только с суффиксом -ks без личных окончаний.

<table>
    <tr>
        <td>Утвердительная форма
            Jaatav vorm
        </td>
        <td>Отрицательная форма
            Eitav vorm
        </td>
    </tr>
    <tr>
        <td>ma oleks(in) armastanud</td>
        <td>ma ei oleks (poleks) armastanud
    <tr>
        <td>sa oleks(id) armastanud</td>
        <td>sa ei oleks armastanud
    <tr>
        <td>ta oleks armastanud</td>
        <td>ta ei oleks armastanud
    <tr>
        <td>me oleks(ime) armastanud</td>
        <td>me ei oleks armastanud
    <tr>
        <td>te oleks(ite) armastanud</td>
        <td>te ei oleks armastanud
    <tr>
        <td>nad oleks(id) armastanud</td>
        <td>nad ei oleks armastanud
</table>

Косвенное наклонение.
При помощи косвенного наклонения мы выражаем информацию, в которой не можем быть полностью уверенны. Может быть это происходило, а может быть и нет. 
Признаком этой формы для всех лиц является окончание -vat, которое мы добавляет к основе ma-инфинитива. На русский язык переводятся с использованием слов: будто бы, говорят, якобы, вроде, мол и т.п.. Отрицание передается при помощи частицы ei. 
Näide:
Ta abielluvat (abiellu/ma) talvel. Он вроде как женится зимой.
Sa tantsivat (tantsi/ma) hästi. Говорят, ты хорошо танцуешь. 
Te sõitvat (sõit/ma) puhkusele Kreekasse. Говорят, вы будто бы едете в Грецию в отпуск. 
Nad ei töötavat (tööta/ma) tehases. Они якобы не работают на заводе.

Формы прошедшего времени образуются сочетание глагола olema в косвенном наклонении и причастия –nud, которое, как мы помним, в свою очередь образуется от da-инфинитива.
Näide: 
Ta olevat abiellunud (abiellu/da) talvel. Он вроде как женился зимой.
Sa olevat varem tantsinud (tantsi/da) hästi. Говорят, ты хорошо раньше танцевал. 
Te olevat sõitnud (sõit/a) puhkusele Kreekasse. Говорят, вы будто бы ездили в Грецию в отпуск. 
Nad ei olevat kunagi töötanud (tööta/da) tehases. Они якобы никогда не работали на заводе.
Что касается грамматических форм глагола, то на этом мы с Вами остановимся. Единственный нюанс, который я бы хотела Вам объяснить, это некоторые суффиксы, с помощью которых можно образовывать глаголы. Конечно, глаголы можно образовывать от разных частей речи: от существительных, прилагательных, наречий, и даже от других глаголов. Забивать голову всеми окончания нет смысла. Когда Вы будете в тексте встречать новый глагол, смотреть стоит не только на суффикс, но и на его основу, ведь если там присутствует знакомое слово, это лишь поможет в его переводе. Suurenema в своей основе имеет корень suur, который переводится как большой, и уже значение глагола ищите в близи этого слова. Suurenema – увеличиться, расти.
На чем стоит остановиться подробнее, так это на парных переходных и непереходных глаголах. В русском языке непереходным глаголам обычно соответствуют формы, заканчивающие на -ся: начинать – начинаться, одевать-одеваться и т.п.. Встречается, что в эстонском языке эти пары переводятся совершенно разными глаголами, и даже не однокоренными. Но в большинстве случаев корень у глаголов сохраняется, меняется лишь словообразующие суффиксы.
Суффиксы, образующие переходные и непереходные глаголы.
-u-
Суффикс -u- глагола – это всегда показатель непереходного глагола. При образовании он или присоединяется к основе переходного глагола, если она заканчивается на согласную букву, или заменяет гласную в конце основы. 
Muutma – muutUma, менять – меняться.
Peatama – peatuma, останавливать – останавливаться.
Kordama – korduma, повторять – повторяться.
-ta- (-da-), -sta-, -nda-
При помощи этих суффиксов наоборот образуются всегда переходные глаголы. Правда образовываться могут от основ разных форм глагола, и даже сокращенных.
Lõppema – LõpeTAma, заканчиваться – заканчивать.
Kaduma (kaob) – kaoTAma, теряться – терять.
Algama – AlusTAma, начинаться – начинать.
Auruma – auruSTAma, испаряться – испарять.
Mõjuma – mõjuTAma=mõjuSTAma, влиять, сказываться -  влиять, воздействовать.
Suurenema – suureNDAma, увеличиваться – увеличивать.
`

export default translate()(props => <MarkdownPage title={props.t('lesson', { number: 15 })} source={source}/>)
