import React from 'react'
import { translate } from 'react-i18next'
import MarkdownPage from '../components/MarkdownPage'

const source = `
В разных уроках мы по отдельности брали уже и прилагательные, и числительные. Буквально на прошлом уроке мы поговорили снова про имена существительные. Из склоняемых частей речи нам осталось разобрать местоимения. Предлагаю сейчас этим и заняться.

Местоимения. Asesõnad.
Местоимения – эти часть речи, которая указывает на какое-то лицо, предмет, на признаки, но их не называет.
Inimene on ukse taga. Tema on ukse taga. Keegi on ukse taga.
Человек за дверью. Он/Она за дверью. Кто-то за дверью.
Местоимений, конечно, много.  Возьмем несколько подвидов, и рассмотрим особенности их склонения.
С некоторыми мы уже знакомы с самых первых наших уроков. Такие, например, как личные местоимения единственного и множественного числа у нас, я думаю, уже доведены до автоматизма.
Личные местоимения. Isikulised asesõnad.

Чтобы суммировать знания по этим личным местоимениям, давайте посмотрим, как изменяются все 6 личных местоимений по 14 падежам эстонского языка.
Как мы видим в таблице, для местоимений даны полные и рядом короткие формы.  Разницы в их использовании практически нет, но вот если Вы хотите на местоимение в предложении сделать акцент, то следует употребить именно полную форму.
Эти короткие формы существуют у многих падежей. В первых трех основных падежах и во внешних падежах места короткие формы используются достаточно часто.  У внутренних падежей места они конечно тоже имеются, но используются намного реже.



Näide:
Ära mult seda küsi. У меня это не спрашивай.
Sinu õele meeldib head muusikat kuulata. Твоей сестре нравится слушать хорошую музыку.
Me ei saa ilma nendeta tööd lõpetada. Мы не можем без них закончить работу.
Teieni pole see info veel jõudnud. До вас эта информация еще не дошла.
Притяжательные местоимения. Omastavad asesõnad.
Притяжательные местоимения указывают на принадлежность чему-либо, кому- либо. В русском языке это местоимения – свой, своя, свое, в эстонском это все вмещается в одном слове – oma. Первые три падежа для него выглядят одинаково – oma, oma, oma, чтобы же сделать следующие падежи, мы просто добавляем нужное окончание. 
Näide:
Annan talle oma raamatu. Дам ему свою книгу.
See maja on Tiina oma. Это дом Тийны.
Nad on ammu juba omad inimesed. Они давно уже свои люди.
NB! Что интересно, если у нас в предложении выражена принадлежность к лицу (его книга, у их брата, своему другу), то не зависимо от того, в каком падеже стоит следующее за местоимением слово, само местоимение останется во втором падеже. Это будет касаться как личных местоимений, так и притяжательного местоимения. А со словом oma так вообще интересная история получается. Притяжательное местоимение oma, указывая на принадлежность к кому-нибудь, и вовсе используется в основном только в одном своем виде, в форме падежа omastav, то есть в предложениях практически не меняется.
See on minu vend. Это мой брат.
Ma annan oma õpiku tema sõbrale. Я дам свой учебник его другу.
Ma armastan oma meest. Я люблю своего мужа.
Указательные местоимения. Näitavad asesõnad.
В эту группу местоимений входят уже известные нам местоимения see и need. Оба переводятся как «это», ведь в русском языке сам предмет или лицо говорит о его количестве, а не используемое с ним местоимение. В эстонском же языке, если Вы указываете на один предмет, лицо, то используете местоимение see, а если видите несколько, то и существительное меняете на множественное число, и местоимение меняете на need. 
Näide:
See õpilane peab klassis olema. Этот ученик должен быть в классе.
Need inimesed elavad linnas, kuid see mees tahab maal elada. Эти люди живут в городе, а этот мужчина хочет жить в деревне.
Первые три падежа для этих местоимений мы уже брали: see-selle-seda и need-nende-neid.  Местоимение need со второго падежа полностью повторяет личное местоимение nemad(nad), так что его формы будут Вам уже знакомы. А вот для местоимения see рекомендую посмотреть внимательно падежи, начиная с четвертого, ведь здесь тоже будут короткие формы
Дополнительно в рамке ниже будет представлено еще одно местоимение – ise, сам (сама, само). Формально оно относится к возвратным местоимениям/enesekohased asesõnad. Но так как фактически оно тоже указывает на человека, предмет (правда на себя самого, кто совершает действие), я решила эти две группы местоимений соединить.


Неопределенные местоимения. Umbmäärased asesõnad.
Неопределенные местоимения указывают на неопределенность предмета, существа или их признака. Из этой группы местоимений мы возьмем следующие:
keegi – кто-то, кто-либо, кто-нибудь
miski – что-то, что-либо, что-нибудь
mingi – какой-то, какой-либо, какой-нибудь
mõni – какой-то, какой-либо, какой-нибудь, некоторый, несколько
paljud - многие


NB! С неопределенными местоимениями часто можно встретить употребление суффиксов gi/ki. Суффиксы эти добавляются в самом конце уже сформированного падежа. Если слово оканчивается на гласную или на согласные l, m, n, r, v, то к нему будет присоединяться суффикс -gi. После всех остальных согласных используется -ki.
Näide:
Kas keegi on seda filmi näinud? Кто-нибудь видел этот фильм?
Ma ei vihasta millegi peale. Я не сержусь ни на что.
Laua peal on mingid paberid. На столе какие-то бумаги.
Räägi mõne sõnaga, kuidas elad. Расскажи в двух словах, как живёшь.
Sõda jättis paljud kodutuks. После войны многие остались без дома.
`

export default translate()(props => <MarkdownPage title={props.t('lesson', { number: 17 })} source={source}/>)
