import React from 'react'
import { translate } from 'react-i18next'
import MarkdownPage from '../components/MarkdownPage'

const source = `
Уж очень хочется  начать этот урок в духе компьютерных игр:
ПОЗДРАВЛЯЮ ВАС! УРОВЕНЬ ПРОЙДЕН!
Падежи эстонского языка мы рассмотрели. Многие, кто впервые слышит о том факте, что в языке аж 14 падежей, сразу пугается. Но стоит их рассмотреть поближе и понять их логику, страх пропадает. А ведь определенная логика здесь точно есть. Учим первые три падежа, все остальные, начиная с четвертого, образуются от второго при помощи добавления окончания. То есть стоит задать к слову правильный вопрос, и проблема с выбором окончания, то бишь падежа, решится сама собой.
Загвоздка здесь заключается вот в чем: 14 падежей эстонского языка не покрывают то несметное множество предлогов, что есть в русском языке! 
Возьмем, к примеру, родительный падеж в русском языке. Он отвечает на вопросы кого? чего? И уже к этим вопросам мы может добавлять предлоги, но при этом падеж остается все тот же родительный — от кого? около чего? у кого? без чего? и так далее…
До этого мы рассматривали падежи, то есть затронули только некоторую часть предлогов. Далее же нам предстоит выяснить, что же делать с остальными предлогами, так сказать не вошедшими в рамки 14 падежей эстонского языка. 

### Предлоги и послелоги
### Eessõnad ja tagasõnad 

Также в учебниках по грамматике можно встретить понятие «kaasõnad». Это общее названия и для предлогов, и для послелогов, что переводится дословно «слова идущие вместе с чем-то». Ну а теперь по порядку.
Система русского языка знает только предлоги, которые показывают взаимоотношение двух предметов и находятся всегда перед управляемым словом: книга находится на столе; стул стоит у стены и т.д.
В эстонском языке выразить предлоги можно тремя способами. Какая-то часть из них уходит в окончания, то есть используются уже известные нам падежи, некоторые остаются также предлогами, ну а третий способ, совсем отличный от русского языка, использование послелогов. Предлогов очень мало, в большинстве случаев встречаются послелоги, имеющие те же значения, что и предлоги в русском, но стоящие всегда после управляемого слова.
Задач перед учеником, разбирающим данную тему, стоит обычно 2: во-первых нужно запомнить будет ли каждая эта «частичка» стоять перед словом (в качестве предлога) или после слова (послелогом), и, во-вторых, с каким падежом будет использована. Чтобы хоть как-то систематизировать столь объемную информацию, предлагаю разбить все предлоги и послелоги по темам. В рамках этого шестого урока, мы рассмотрим большую группу предлогов и послелогов, которые используются для указания местоположения предметов и лиц. То есть расширим границы использования падежей места.
Предлоги и послелоги, для указания местоположения.
1. Первая подгруппа, которую мы рассмотрим в рамках этого значения, это будут послелоги, требующие от слова-фразы второго падежа (omastav). Это самая обширная группа послелогов, выражающая пространственные отношения. Им характерно подобное падежам места изменение по направленности действия — где, куда, откуда.


Хотя в выше указанной рамке Вы и можете посмотреть значение этих послелогов на конкретных примерах, некоторые из них все же стоит разобрать еще отдельно.
Kõrvale, kõrval, kõrvalt — эти послелоги образовались от слова «kõrv» — ухо. От этого и выходит их значение: предмет (лицо) будет расположен точно так же как и уши относительно нашей головы, то есть сбоку и с любой стороны. Kass on diivani kõrval. Кошка ни перед, ни за диваном, а именно сбоку от него.
Äärde, ääres, äärest. Äär с эстонского переводится как край, кромка. Используется со словами, где будет прослеживаться четкая грань чего-либо. Чаще всего используется с водными объектами, где можно точно отследить, где заканчивается берег, и начинается вода. Mina puhkan mere ääres. Я отдыхаю около моря.
Полными синонимами между собой являются следующие послелоги: Ligidal=Lähedal, а также Seas=Hulgas. И, конечно, их другие падежные формы ведут себя точно также.

Далеко не все предлоги-послелоги, указывающие на местоположение, образуют подобные изменяющиеся по падежам тройки.
2. Предлоги, требующие падежа omastav:
Läbi — через, сквозь
Üle — через 
Ümber — вокруг. Ümber может стоять как перед словом, так и после. И в том, и в другом случае используется со вторым падежом.
Näide.
Minge üle tänava, siis keerake paremale. Идите через улицу, потом повернете направо.
Jalutame läbi pargi. Прогуливаемся через парк
Koer jookseb ümber laua (laua ümber). Собака бегает вокруг стола.

3. Предлоги, требующие падежа osastav (третьего):
Keset, kesk — посреди, среди, в центре
Mööda — по 
Piki — вдоль, по
Vastu — против, об 
Peale — после (чаще временное отношение, но возможно и территориальное)

Näide.
Taldrik on keset lauda. Тарелка находится на середине стола.
Kesk tuba seisab pisikene laud. Посреди комнаты стоит маленький стол.
Mööda teed sõidab jälgratas. По дороге едет велосипед.
NB! Mööda в значении «по, вдоль» может быть как предлогом, так и послелогом. Mööda teed=teed mööda.
Paat sõidab piki jõge. Лодка двигается по реки (вдоль реки).
Linnuke lendab vastu tuult. Птичка летит против ветра.
Üks vana proua seisab järjekorras peale mind. Одна пожилая дама стоит в очереди после меня.

4. Послелоги, требующие падежа omastav:
Kaudu — через 
Vahetsi — между
Näide.
Minge metsa kaudu! Идите через лес!
Ta liikub ettevaatlikult autode vahetsi.  Он двигается осторожно между машин.

5. Предлог, требующий падежа rajav:
Kuni — до (имеет как пространственное, так и временное значение)
Näide.
Sõber viib mind kuni majani. Друг ведет меня до самого дома.
В этом примере предлог kuni можно и опустить, а вот окончание -ni в слое дом опускать ни в коем случае нельзя!

Синонимичные выражения.
В некоторых случаях можно параллельно использовать как предлог/послелог, так и  падежное окончание.
Näide.
Paneme raamatu lauale. = Paneme raamatu laua peale.  Положим книгу на стол.
Võta toolilt! = Võta tooli pealt! Возьми со стула!
Küsi emalt! = küsi ema käest! Спроси у мамы!
Но если взять даже последний пример, послелог «käest» имеет только значение от кого-то, чего-то. А вот окончание -lt более абстрактно, и поэтому, как мы знаем, зона его использования намного шире. Mina saan tihti kirja sõbraLT. Я часто получаю письмо от друга. Ma olen rahvuseLT venelane. Я по национальности русский.
`

export default translate()(props => <MarkdownPage title={props.t('lesson', { number: 9 })} source={source}/>)
