import React from 'react'
import { translate } from 'react-i18next'
import MarkdownPage from '../components/MarkdownPage'

const source = `
Продолжаем расширять границы наших знаний. Пока мы можем, конечно, составлять только простые предложения: подлежащее + сказуемое. Правда на примере уже десятка глаголов мы научились это делать как в настоящем времени, так и в прошедшем. Пора разбавить наши предложения, и рассмотреть формирование вопросов. 

### Вопросительные слова
### Küsisünad

Предлагаю Вам познакомиться с некоторыми вопросительными словами. Безусловно, это не конечный список вопросительных слов, ему, увы, нет предела. Но нам стоит уже с чего-то начать.
Кто? — Kes? 
Что? — Mis?
Как? — Kuidas?
Где? — Kus?
Куда? — Kuhu?
Откуда? — Kust?
Когда? –Millal?
Почему? — Miks?
Сколько? — Kui palju? (о количестве, дословно «как много»)
Kui kaua? (о времени, дословно  «как долго»)
Какой? — Milline? Missugune?

##### Näide

Kes sina oled? — Кто ты?
Mis see on? — Что это?
Kuidas Teie elate? — Как Вы живете?
Kuidas sul/Teil läheb? — как у тебя/ у Вас дела? (самое распространенное предложение с вопросительным словом как — дословно переводится: как у тебя или у Вас идет?)
Kuidas käsi käib? — как дела? (еще один вариант этого вопроса — дословный перевод: как рука ходит?)
Kus nad töötavad? — Где они работают?
Kuhu ma sõidan? — Куда я еду?
Kust me pärit oleme? — Откуда мы родом? 
Millal nad tulevad? — Когда они придут?
Miks sina võtad selle? — Почему ты берешь это?
Millises linnas sa töötad? — в каком городе ты работаешь?
Последний вопрос стоит рассмотреть отдельно. Вариантами ответа на такой вопрос могут быть:
Ma töötan Tallinnas. Я работаю в Таллинне. 
Ma töötan ilusas linnas. Я работаю в красивом городе.
В первом ответе идет больше констатация фактов, а во втором, присутствует описательная характеристика. Так вот, если мы хотим услышать в ответ именно прилагательные, мы задаем вопрос так, как это указано выше, а вот если мы хотим  услышать более конкретные данные, то в таком случае, помимо слов «milline?» или «missugune?», мы можем в вопросе использовать слово «mis?».
Да-да, вы не ослышались. Вопросительное слово «mis?» мы изначально перевели как «что?». Все конечно верно, это его основное значение, но встречаются случаи, когда мы переведет как «какой?»,  «который?»  и др. Слово, стоящее после «mis»,  подскажет Вам перевод. И если рассматривать наш пример с городами, то вопрос будет звучать следующим образом:
Mis linnas sa töötad?  — В каком городе ты работаешь?
Ma töötan Moskvas. — Я работаю в Москве.

### Вопросительное слово Kas
### Küsisõna Kas

Есть в эстонском языке одно вопросительное слово, которое никак не переводится — «kas?». Для него тоже нет аналога в русском языке, ведь нам сделать из утвердительного предложения общий вопрос очень просто.
Я работаю хорошо.
Я работаю хорошо?
Поставили в конце предложения вопросительный знак вместо точки, а в произношении изменили интонацию на вопросительную, и вуаля, новый тип предложений готов.
В эстонском же языке, как, в принципе, и во многих европейских, есть для этого специальное вопросительное слово. При этом, что интересно, в русском языке мы можем крутить порядок слов в подобных предложениях как хотим (Я работаю хорошо? Я хорошо работаю?). В эстонском языке, нам следует сохранить утвердительное предложение, и всего лишь поставить впереди слово — kas. Но о порядке слов в предложениях мы поговорим ниже, а пока сравните 2 фразы:
Ma töötan hästi
Kas ma töötan hästi?
Если сильно хочется, то можно перевести «kas?» как «разве?», но как Вы могли увидеть в примере, переводить это слово вовсе не обязательно, измените интонацию и все!
 
### Порядок слов в предложении
### Sõnade järjekord lauses

Рассмотрев уже все три типа предложений, пришло время поговорить о порядке слов в них. Здесь главное соблюдать несколько правил.

Первое касается утвердительных и отрицательных предложений:  глагол, то есть сказуемое, должно стоять на втором смысловом месте. На первое место ставим то слово или словосочетание, на которое хотим сделать акцент. Глагол же на третье место может вытиснуть  только местоимение.
Mina õpin eesti keelt juba kolm kuud. Я учу эстонский язык уже 3 месяца.
Eesti keelt ma õpin juba kolm kuud. Эстонский язык я учу уже 3 месяца.
Inglise keelt õpetab hea õpetaja. Английский язык преподает хороший учитель.
See õpetaja ei õpeta prantsuse keelt. Этот учитель не преподает французский язык.

Следующее правило, которое стоит отметить, это о порядке слов в вопросительных предложениях. Здесь главное, это постановка вопросительного слова — оно должно стоять всегда на первом месте, дальше Вы уже распределяете слова по степени важности.
Kes elab Tallinnas?
Kes Tallinnas elab?
Это как в русской народной сказке —  «кто живет в теремочке, кто в теремочке живет». От перемены мест слагаемых сумма не меняется.
Исключением здесь будут только вопросы со словом «kas?», о которых мы говорили выше. Там сохраняется порядок утвердительных предложений, где глагол стоит на втором месте. 

<table>
    <tr>
        <th>1</th>
        <th>2</th>
        <th>3</th>
        <th>4</th>
    </tr>
    <tr>
        <td/>
        <td>Sina</td>
        <td>õpetad</td>
        <td>eesti keelt.</td>
    </tr>
    <tr>
        <td>Kas</td>
        <td>sina</td>
        <td>õpetad</td>
        <td>eesti keelt?</td>
    </tr>
    <tr>
        <td/>
        <td>Nad</td>
        <td>elavad</td>
        <td>Peterburis.<br>(в Санкт-Петербурге)</td>
    </tr>
    <tr>
        <td>Kas</td>
        <td> nad</td>
        <td>elavad</td>
        <td>Peterburis?</td>
    </tr>
</table>
 
Ну и третье правило касается составных глаголов, речь о которых шла на передыдущем занятии. Хотя по сути это касается и всех форм глагола, состоящих из 2х и более слов. Что же с ними такого особенного происходит? Если предложение у нас простое, нераспространённое, то в этом случае мы с ними работаем в обычном порядке: сначала мы ставим первую часть глагола, а потом закрываем частицей, второй частью. Ну а если у нас есть в предложении какие-то слова, относящиеся к глаголу, то мы начинаем также с глагола, потом идут все дополнительные слова, относящиеся к нему, и уже только потом завершаем мысль и закрываем все это оставшейся частью глагола.  Запутала Вас? Давайте разберем на примере.
Для начала возьмем глагол с частицей. Допустим, это будет понимать — aru saama.
Mina saan aru. Я понимаю.
Простое предложение, без лишних слов. В этом случае частица следует сразу после глагола.
Mina ei saa eesti keelest aru. Я не понимаю эстонский язык.
Как мы видим, если в предложении появляются дополнительные слова, относящиеся к глаголу, то их стоит поставить между основным глаголом и частицей. И что закономерно, независимо от того, сколько этих слов используется — два, три или более — все они должны находиться в середине.
Mina saan eesti keelest juba hästi aru. Я уже хорошо понимаю эстонский язык.
Что касается форм глагола, состоящих из нескольких слов, мы можем взять для примера, прошедшее время, где используется глагол olema в нужном лице и форма –nud. 
Mina olen armastanud. Я любила.
Mina olen sind armastanud. Я тебя любила.
Mina olen sind väga armastanud. Я тебя очень любила.


Ну что, пришло время немного суммировать наши знания о глаголах. Мы познакомились с инфинитивами (начальными формами), с тремя временами: с одним прошедшим, с настоящим и с будущим (напомню, что в эстонском языке будущее время образуется при помощи настоящего и дополнительных слов, указывающих, что действие произойдет именно в будущем). Также мы с Вами узнали об утвердительной и отрицательной форме для всех трех времен, плюс научились задавать вопросы.
Все это можно уместить в одной таблице. Для примера возьмем новый глагол «читать» — lugema, lugeda, loeb


<table>
<tr><th/><th>Прошедшее время</th><th>Настоящее время</th><th>Настоящее время</th></tr>
<tr>
<td>
+</td><td>Mina olen lugenud.<br>
Sina oled lugenud.<br>
Tema on lugenud.<br>
Meie oleme lugenud.<br>
Teie olete lugenud.<br>
Nemad on lugenud.<br>
</td><td>
Mina loen.<br>
Sina loed.<br>
Tema loeb.<br>
Meie loeme.<br>
Teie loete.<br>
Nemad loevad.<br>
</td><td>
Mina loen homme.<br>
Sina loed homme.<br>
Tema loeb homme.<br>
Meie loeme homme.<br>
Teie loete homme.<br>
Nemad loevad homme.<br>
</td>
</tr>
<tr>
<td>
-</td><td>Mina ei ole lugenud.<br>
Sina ei ole lugenud.<br>
Tema ei ole lugenud.<br>
Meie ei ole lugenud.<br>
Teie ei ole lugenud.<br>
Nemad ei ole lugenud.<br>
</td><td>
Mina ei loe.<br>
Sina ei loe.<br>
Tema ei loe.<br>
Meie ei loe.<br>
Teie ei loe.<br>
Nemad ei loe.<br>
</td><td>
Mina ei loe homme.<br>
Sina ei loe homme.<br>
Tema ei loe homme.<br>
Meie ei loe homme.<br>
Teie ei loe homme.<br>
Nemad ei loe homme.<br>
</td>
</tr>
<tr>
<td>
?</td><td>Kas ma olen lugenud?<br>
Kas sa oled lugenud?<br>
Kas ta on lugenud?<br>
Kas me oleme lugenud?<br>
Kas teie olete lugenud?<br>
Kas nad on lugenud?<br>
</td><td>
Kas ma loen?<br>
Kas sa loed?<br>
Kas ta loeb?<br>
Kas meie loeme?<br>
Kas teie loete?<br>
Kas nad loevad?<br>
</td><td>
Kas ma loen homme?<br>
Kas sa loed homme?<br>
Kas ta loeb homme?<br>
Kas meie loeme homme?<br>
Kas teie loete homme?<br>
Kas nad loevad homme?<br>
</td>
</tr>
</table>

### Союзные слова
### Sidesõnad

Продолжаем нарабатывать словарный запас и для этого рассмотрим возможности расширения предложений. Кое-какие союзные слова нам уже встречались. Предлагаю вспомнить и дополнить этот список.
Ja — и
Aga — а, но
Kuid — а, но
Või — или 
Et — что 
Sest — потому, что
Kui — когда; если; чем; как (перевод зависит от контекста, смотря что нужно выразить — поставить условие, или что-то сравнить )
Sellepärast — поэтому
Попробуйте перевести следующий небольшой текст сначала самостоятельно, используя словарь. И если возникнут вопросы, обратитесь к переводу снизу.
Minul on kodus kass. Ta on ilus ja hea, aga ma tahan (tahtma, tahta, tahab) ka koera. Ma arvan, et koer on parem, sest ta on tark. Kassid ainult magavad või mängivad terve päev. Kui mul on koer ja kass, siis ma olen õnnelik.
У меня дома есть кошка. Она красивая и хорошая, но я хочу также собаку. Я думаю, что собака лучше, потому что она умная. Кошки только спят и играют целый день. Если у меня будет собака и кошка, я буду счастлива

### Наречия
### Määrsõnad

Разобравшись немного с эстонскими глаголами, можно описать уже и признак этого действия, его свойства. А этим как раз и занимается наречие. Конечно, их существует несметное множество. Но мы возьмем несколько групп.
Первое что нам понадобится — это наречия, указывающие на то, в каком времени происходит действие:
Eile — вчера 
Täna — сегодня 
Homme — завтра 
Üleeile — позавчера 
Ülehomme — послезавтра (как видите, приставка üle на русский переводится как поза-, так и после-. Дословно она обозначает «через»: через вчера = позавчера, через завтра = послезавтра) 

Разобравшись с днем, можно также и указать в какое время суток совершается действие:

Hommikul — утром 
Päeval — днем 
Õhtul — вечером 
Öösel — ночью 
Ну и продолжим список несколькими наречиями обозначающими время и состояния. С помощью этих слов мы сможем приукрасить наши предложения, и внести дополнительный смысл
Tavaliselt — обычно 
Mõnikord — иногда 
Tihti — часто
Harva — редко
Vara — рано 
Hilja — поздно 
Jälle — снова, вновь 
Siis — тогда 
Hästi — хорошо 
Halvasti — плохо 


### Числительные
### Arvsõnad

Процесс обучения будет проходить более плодотворно, если Вы постараетесь внедрить эстонский язык во все сферы своей жизни. Не обязательно заниматься новыми словами, грамматикой, только в строго отведенное для этого время, то есть сесть за стол, разложить материалы перед собой, и заявить всем и себе, что вот все, я учусь. Приучите себя уделять время эстонскому языку и в более непринужденной обстановке: на прогулке, по дороге на работу/учебу, на тренировке и т.д. и т.п. Заведите себе небольшие блокноты, карточки, которые удобно возить собой, и при малейшей возможности полистать. У меня есть ученики, кто даже в пробке умудряется заниматься, прикрепив заметки на зеркало заднего вида ☺ Но с этим аккуратно, все-таки безопасность превыше всего. Я это все к тому,  что новые слова сами собой не выучатся, этому стоит уделять внимание.
Я предлагаю Вам очередную порцию слов. На этот раз это количественные числительные.  Конечно, об этой части речи мы поговорим подробнее, но немного позже, а пока предлагаю Вашему вниманию числительные от одного до десяти:
1 — üks
2 — kaks
3 — kolm
4 — neli
5 — viis
6 — kuus
7 — seitse
8 — kaheksa
9 — üheksa
10 — kümme
Сразу скажу, чтобы усвоить последующие числительные, нам понадобятся именно эти 10, так что когда у Вас есть свободное время, начинаем их учить и использовать на практике. А где как не на улице, этим заниматься. Так что вперед на прогулку, прочитывайте все числа, которые видите — номера машин, домов… Не беда, что двух- и трехзначные Вы пока не знаете, дробите на однозначные. Главное — это довести первые десять чисел до автоматизма.

### Отрицательные частицы
### Eitavad sõnad

Мы уже познакомились с несколькими отрицательными частицами: Ära, Ärge, Ei. Первые 2 используются только в повелительном наклонении, а вот частица «EI» — это самая распространенная отрицательная частица. На русский мы ее переведем как не, нет. Но есть одна особенность, в качестве предлога «НЕ» на русском языке, «EI» может использоваться только с глаголами. Со всеми же другими частями речи используется слово «MITTE».

##### Näide

Kas tema ei ole mees? Он не мужчина?
Sina ei sõida. Ты не едешь.
Ärge armastage! Не любите!
Ära jää hiljaks! Не опаздывай
Mina mitte. Я нет. 
Mitte mina.  Не я. 
Mitte see inimene. Не этот человек. 
Mitte väga.  Не очень.
`

export default translate()(props => <MarkdownPage title={props.t('lesson', { number: 4 })} source={source}/>)
