import React from 'react'
import { translate } from 'react-i18next'
import MarkdownPage from '../components/MarkdownPage'

const source = `
Несколько последних уроков мы говорили только о склоняемых частях речи, а вот про глаголы совсем забыли. А это не правильно, ведь без них не может быть полного предложения. 
Напомню, для каждого глагола мы учим 3 формы – MA-инфинитив, DA-инфинитив и форму 3-го лица единственного числа настоящего времени. Каждая из них нам необходима для дальнейшего словообразования. С третьей формой все вроде понятно, она показывает нам, как выглядит основа глагола, когда мы хотим его спрягать в настоящем времени. Добавляя уже другие окончания вместо -b,  мы можем получить все личные формы единственного и множественного числа.
Предлагаю сегодня поговорить более подробнее про инфинитивы. Все-таки их две формы, и нам нужно до конца понять, в чем же между ними разница.
Формы MA-инфинитива и DA-инфинитива.
Для начала вспомним, как нам распознать эти формы. С ma-инфинитивом проще, он всегда оканчивается на -ma. Именно эту форму глагола мы можем найти в словаре (хотя я уже говорила,  что хороший!!! эстонско-русский словарь даст все три интересующие нас основные формы).
Da-инфинитив в отличие от своего предшественника имеет три варианта окончаний – признаков. Da-инфинитив может оканчиваться на -da, на -ta, и на -a. Но нужно быть внимательными и правильно определить, где заканчивается основа глагола, и начинается окончание. Существует два варианта развития событий: буквы -T и -D могут быть частью основы слова, а могут быть и признаком инфинитива -ta, -da. Напомню, правило здесь звучит так: если буквы -T или -D прослеживаются хотя бы в 2х из трех основных форм глагола, тогда они принадлежат к основе, и показателем инфинитива будет только -a.
Näide:
Kirjutama, kirjutada, kirjutab 
Aitama, aidata, aitab 
Sõitma sõita sõidab 
Minema, minna, läheb
Обе формы инфинитива переводятся на русский язык одинаково, то есть и kirjutama, и kirjutada мы переведем как писать. Разница с русским состоит в том, что в эстонском языке нам постоянно нужно будет выбирать, какую из двух форм использовать, а это уже грамматический аспект. Главное знать определенные правила, какая форма от чего образуется. 
Конечно, если мы имеем дело с простым глаголом, где основа не меняется (armastama, armastada, armastab – любить), то при образовании новых отглагольных форм, нам будет все равно какую из трех основных форм взять. А ведь может случиться и так, что все три формы отличаются друг от друга (tegema, teha, teeb – делать), тогда нас выручит именно знание правил.

Помимо того, что нам необходим инфинитив с грамматической стороны, чтобы образовать новые слова, так ведь еще можно же и непосредственно в предложении его использовать - я люблю играть, я пойду играть и тд. Рассмотрим эту ситуацию подробнее.
Употребление инфинитивов.
Я люблю играть, я пойду играть … Какой бы не использовался первый глагол в предложении, форма слова играть в русском языке не поменялась. А в эстонском языке нам нужно решить, когда использовать ma-инфинитив mängima, а когда da-инфинитив mängida. Все будет зависеть как раз от впереди стоящего глагола.
Ниже в таблице представлены группы глаголов, после которых мы обязательно используем ma-инфинитив:


Если немного суммировать картину, представленную в таблице, то можно заключить, что ma-инфинитив используется в основном после глаголов, которые выражают движение и начало действия.
Далее давайте разберемся с da-инфинитивом, здесь тоже можно выделить несколько групп глаголов:


Если насчет ma-инфинитивов мы выделили в основном движение и начало действия, то в отношении da-инфинитивов можно сказать, что они в основном используются после глаголов, выражающих чувства, желания и возможности.
Конечно же это не полный список глаголов, поэтому рекомендую вам выучить категории групп, и тогда вам уже проще будет разделить встречающиеся новые глаголы по этим критериям.

Есть еще кое-что, о чем следует обязательно сказать, когда мы разбираем тему инфинитивы, и в частности это касается ma-инфинитивов. Форма ma-инфинитива в эстонском языке склоняется, используется вместе с некоторыми падежными окончаниями! Да-Да, Вы не ослышались. Падежные окончания бывают не только у имен существительных, прилагательных, числительных и местоимений, а еще и у форм ma-инфинитива глаголов.
Падежные формы ma-инфинитива. 
Ma-инфинитив, помимо основной формы, которая заканчивается на -ma, имеет еще несколько форм.
-mas: с помощью этой формы описывается действие, которое происходит в настоящий момент или будет происходить в ближайшем будущем. Ta on suusatamas. Что будет означать, он сейчас катается на лыжах. Образуется при помощи ma-инфинитива + -s.
-mast: данная форма может быть использована для возвращения откуда-то. Также используются вместе со словами, требующими от глагола указания «от чего-то». Ta keeldub seda tegemast. Он отказывается от того, чтобы это сделать – отказывается это делать. Образование формы: ma-инфинитива + -st.
-maks:  форма показывает, что действие происходит для чего-то, то есть указывает на его причину. Ma sõidan Tartusse, astumaks Ülikooli. Я еду в Тарту, чтобы поступать в Университет. Образуется при помощи ma-инфинитива + -ks.
-mata: при помощи этой формы можно сделать антоним для причастия-прилагательного, описывающего объект, или чтобы указать что что-то происходит без какого-то процесса. Loetud raamat (прочитанная книга) - lugemata raamat (непрочитанная книга). Ma ei saa elada ilma lugemata – я не могу жить без чтения (без того, чтобы читать). Образование формы: ma-инфинитива + -ta. 
Точно так же, как мы с Вами выделяли списки глаголов, после которых используются ma- и da-инфинитивы, существуют слова, с которыми обязательно используются падежные формы глаголов.
`

export default translate()(props => <MarkdownPage title={props.t('lesson', { number: 14 })} source={source}/>)
